In [29]:
import pandas as pd
import numpy as np

In [30]:
step_data = [3620, 7891, 9761, 3907, 4338, 5357]

step_counts = pd.Series(step_data, name='steps')

print(step_counts)

0    3620
1    7891
2    9761
3    3907
4    4338
5    5357
Name: steps, dtype: int64

In [31]:
step_counts.index = pd.date_range('20150329', periods=6)
print(step_counts)

2015-03-29    3620
2015-03-30    7891
2015-03-31    9761
2015-04-01    3907
2015-04-02    4338
2015-04-03    5357
Freq: D, Name: steps, dtype: int64

In [32]:
print(step_counts["2015-04-01"])

print(step_counts[3])

print(step_counts["2015-04"])

3907
3907
2015-04-01    3907
2015-04-02    4338
2015-04-03    5357
Freq: D, Name: steps, dtype: int64

In [33]:
print(step_counts.dtypes)

step_counts = step_counts.astype(np.float64)

print(step_counts.dtypes)

int64
float64

In [34]:
step_counts[1:3] = np.NaN

step_counts = step_counts.fillna(0.)

print(step_counts[1:3])

2015-03-30    0.0
2015-03-31    0.0
Freq: D, Name: steps, dtype: float64

In [35]:
cycling_data = [10.7, 0, None, 2.4, 15.3, 10.9, 0, None]
joined_data = list(zip(step_data, cycling_data))
activity_df = pd.DataFrame(joined_data)
activity_df

      0     1
0  3620  10.7
1  7891   0.0
2  9761   NaN
3  3907   2.4
4  4338  15.3
5  5357  10.9

In [36]:
activity_df = pd.DataFrame(joined_data, index=pd.date_range('20150329', periods=6), columns=['Walking', 'Cycling'])
activity_df

            Walking  Cycling
2015-03-29     3620     10.7
2015-03-30     7891      0.0
2015-03-31     9761      NaN
2015-04-01     3907      2.4
2015-04-02     4338     15.3
2015-04-03     5357     10.9